STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_SED_Coap_Multicast/STM32_WPAN/App/app_thread.c
}

/**
  * @brief  Trace the error or the warning reported.
  * @param  ErrId :
  * @param  ErrCode :
  * @retval None
  */
void APP_THREAD_Error(uint32_t ErrId, uint32_t ErrCode)
{
  switch(ErrId)
  {
    case ERR_REC_MULTI_MSG_FROM_M0 :
      APP_THREAD_TraceError("ERROR : ERR_REC_MULTI_MSG_FROM_M0 ",ErrCode);
      break;
    case ERR_THREAD_SET_STATE_CB :
      APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_STATE_CB ",ErrCode);
      break;
    case ERR_THREAD_SET_CHANNEL :
      APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_CHANNEL ",ErrCode);
      break;
    case ERR_THREAD_SET_PANID :
      APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_PANID ",ErrCode);
      break;
    case ERR_THREAD_IPV6_ENABLE :
      APP_THREAD_TraceError("ERROR : ERR_THREAD_IPV6_ENABLE ",ErrCode);
      break;
    case ERR_THREAD_COAP_START :
      APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_START ",ErrCode);
      break;
    case ERR_THREAD_COAP_ADD_RESSOURCE :
      APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_ADD_RESSOURCE ",ErrCode);
      break;
    case ERR_THREAD_MESSAGE_READ :
      APP_THREAD_TraceError("ERROR : ERR_THREAD_MESSAGE_READ ",ErrCode);
      break;
    case ERR_THREAD_COAP_SEND_RESPONSE :
      APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_SEND_RESPONSE ",ErrCode);
      break;
    case ERR_THREAD_COAP_APPEND :
      APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_APPEND ",ErrCode);
      break;
    case ERR_THREAD_COAP_SEND_REQUEST :
      APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_SEND_REQUEST ",ErrCode);
      break;
    case ERR_TIMER_INIT :
      APP_THREAD_TraceError("ERROR : ERR_TIMER_INIT ",ErrCode);
      break;
    case ERR_TIMER_START :
      APP_THREAD_TraceError("ERROR : ERR_TIMER_START ",ErrCode);
      break;
    case ERR_THREAD_CHECK_WIRELESS :
      APP_THREAD_TraceError("ERROR : ERR_THREAD_CHECK_WIRELESS ",ErrCode);
      break;
    default :
      APP_THREAD_TraceError("ERROR Unknown\n",0);
      break;
  }
}

/**
 * @brief Process associated to the sending of a COAP request.
 * @param  None
 * @retval None
 */
static void APP_THREAD_SendCoapMsg(void)
{
  APP_THREAD_SendCoapMulticastRequest(1);
}

static void APP_THREAD_CoapTimingElapsed( void )
{
  otDeviceRole role;

  role = otThreadGetDeviceRole(NULL);

  if ((role == OT_DEVICE_ROLE_CHILD) || (role == OT_DEVICE_ROLE_ROUTER))
  {
    if (sleepyEndDeviceFlag == TRUE)
    {
      SCH_SetTask(TASK_COAP_SEND_MSG,CFG_SCH_PRIO_1);
    }
  }
}

static void APP_THREAD_SetThreadMode( void )
{
  SCH_SetTask(TASK_SET_THREAD_MODE,CFG_SCH_PRIO_1);
}

/**
  * @brief Dummy request handler
  * @param
  * @retval None
  */
static void APP_THREAD_DummyReqHandler(void    * p_context,
                           otCoapHeader        * pHeader,
                           otMessage           * pMessage,
                           const otMessageInfo * pMessageInfo)
{
}


/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief Thread initialization.
 *        This function configure the Thread mesh network.
 *
 *        It sets the following parameters :
 *        - call back (used to notify state change)
 *        - channel Id
 *        - panId
 *        and enable
 *        - IPV6
 *        - Thread
 *        - Coap
 *
 * @param  None
 * @retval None
 */
static void APP_THREAD_DeviceConfig(void)
{
  otError error;


  /* Configure the call-back in order to be notified when the device change its state */
  error = otInstanceErasePersistentInfo(NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_ERASE_PERSISTENT_INFO,error);
  }
  otInstanceFinalize(NULL);
  otInstanceInitSingle();
  error = otSetStateChangedCallback(NULL, APP_THREAD_StateNotif, NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_STATE_CB,error);
  }
  /* Set the channel */
  error = otLinkSetChannel(NULL, C_CHANNEL_NB);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_CHANNEL,error);
  }
  /* Set the pandId */
  error = otLinkSetPanId(NULL, C_PANID);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_PANID,error);
  }
  /* Activate IPV6 */
  error = otIp6SetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
   APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE,error);
  }

  /* Start Thread */
  error = otThreadSetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_START,error);
  }
  /* Start the COAP server */
  error = otCoapStart(NULL, OT_DEFAULT_COAP_PORT);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_START,error);
  }
  /* Add COAP resources */
  error = otCoapAddResource(NULL, &OT_Ressource);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE,error);
  }
}

/**
 * @brief This function is used to set the sleepyEndDevice mode
 *        and configure its pool period.
 *
 * @param None
 * @retval None
 */
static void APP_THREAD_SetSleepyEndDeviceMode(void)
{
  otError   error = OT_ERROR_NONE;

  /* Set the pool period to 5 sec. It means that when the device will enter
   * in 'sleepy end device' mode, it will send an ACK_Request every 5 sec.
   * This message will act as keep alive message.
   */
  otLinkSetPollPeriod(NULL,5000U);

  /* Set the sleepy end device mode */
  OT_LinkMode.mRxOnWhenIdle = 0;
  OT_LinkMode.mSecureDataRequests = 1U;
  OT_LinkMode.mDeviceType = 0;
  OT_LinkMode.mNetworkData = 1U;

  error = otThreadSetLinkMode(NULL,OT_LinkMode);
  if (error != OT_ERROR_NONE)
    APP_THREAD_Error(ERR_THREAD_LINK_MODE,error);

  /* After reaching the child or router state, the system
   *   a) sets the 'sleepy end device' mode
   *   b) perform a Thread stop
   *   c) perform a Thread start.
   *
   *  NOTE : According to the Thread specification, it is necessary to set the
   *         mode before starting Thread.
   *
   * A Child that has attached to its Parent indicating it is an FTD MUST NOT use Child UpdateRequest
   * to modify its mode to MTD.
   * As a result, you need to first detach from the network before switching from FTD to MTD at runtime,
   * then reattach.
   *
   */
  if (sleepyEndDeviceFlag == FALSE)
  {
    error = otThreadSetEnabled(NULL, false);
    if (error != OT_ERROR_NONE)
      APP_THREAD_Error(ERR_THREAD_LINK_MODE,error);
    error = otThreadSetEnabled(NULL, true);
    if (error != OT_ERROR_NONE)
      APP_THREAD_Error(ERR_THREAD_LINK_MODE,error);
    sleepyEndDeviceFlag = TRUE;
  }

